In [6]:
set(['C', 'E', 'E', 'K', 'K', 'M', 'N', 'N', 'O', 'O', 'Y', 'Y'])

{'C', 'E', 'K', 'M', 'N', 'O', 'Y'}

In [13]:
set("C,C, D, D, D, E, K, O, O, Y".split(","))

{' D', ' E', ' K', ' O', ' Y', 'C'}

In [16]:
str_list = "C,E,E,K,K,M,N,N,O,O,Y,Y,C,C,D,D,D,E,K,O,O,Y,A,A,E,E,K,K,K,M,M,N,N,A,C,C,C,M,O,U,U,U,Y,C,E,E,I,I,I,I,K,K,O,O,O"
set(str_list.split(","))

{'A', 'C', 'D', 'E', 'I', 'K', 'M', 'N', 'O', 'U', 'Y'}

In [17]:
len(set(str_list.split(",")))

11

In [18]:
import pandas as pd

In [30]:
df = pd.read_csv("freq.csv", sep="\t")
df

    TID    C    E    K    M    N    O    Y    D    A    U    I
0  T100  1.0  1.0  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN
1  T200  1.0  1.0  1.0  NaN  NaN  1.0  1.0  1.0  NaN  NaN  NaN
2  T300  NaN  1.0  1.0  1.0  1.0  NaN  NaN  NaN  1.0  NaN  NaN
3  T400  1.0  NaN  NaN  1.0  NaN  1.0  1.0  NaN  1.0  1.0  NaN
4  T500  1.0  1.0  1.0  NaN  NaN  1.0  NaN  NaN  NaN  NaN  1.0

In [52]:
cond1 = df['K'] == 1.0
cond2 = df['M'] == 1.0

df[cond1 & cond2]

    TID    C    E    K    M    N    O    Y   D    A   U   I
0  T100  1.0  1.0  1.0  1.0  1.0  1.0  1.0 NaN  NaN NaN NaN
2  T300  NaN  1.0  1.0  1.0  1.0  NaN  NaN NaN  1.0 NaN NaN

In [73]:
cond1 = df['M'] == 1.0
cond2 = df['O'] == 1.0
cond3 = df['Y'] == 1.0

df[cond1 & cond2 & cond3]

    TID    C    E    K    M    N    O    Y   D    A    U   I
0  T100  1.0  1.0  1.0  1.0  1.0  1.0  1.0 NaN  NaN  NaN NaN
3  T400  1.0  NaN  NaN  1.0  NaN  1.0  1.0 NaN  1.0  1.0 NaN

In [89]:
cond1 = df['K'] == 1.0
cond2 = df['M'] == 1.0
cond3 = df['O'] == 1.0
cond4 = df['Y'] == 1.0

df[cond1 & cond2 & cond3 & cond4]

    TID    C    E    K    M    N    O    Y   D   A   U   I
0  T100  1.0  1.0  1.0  1.0  1.0  1.0  1.0 NaN NaN NaN NaN

In [96]:
cond1 = df['E'] == 1.0
cond2 = df['K'] == 1.0
cond3 = df['M'] == 1.0
cond4 = df['O'] == 1.0
cond5 = df['Y'] == 1.0

df[cond1 & cond2 & cond3 & cond4 & cond5]

    TID    C    E    K    M    N    O    Y   D   A   U   I
0  T100  1.0  1.0  1.0  1.0  1.0  1.0  1.0 NaN NaN NaN NaN